//👀DESCRIPTION:
//Перепишите функцию, используя оператор '?' или '||'
//
//
// Следующая функция возвращает true, если параметр age больше 18.
//
// В ином случае она задаёт вопрос confirm и возвращает его результат.
//function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     return confirm('Родители разрешили?');
//   }
// }
//Перепишите функцию, чтобы она делала то же самое, но без if, в одну строку.
//
// Сделайте два варианта функции checkAge:
//
//     Используя оператор ?
//     Используя оператор ||

//👨‍💻SOLUTION:
// function checkAge(age) {
//     let isAge = (age > 18) ? true : 'Родители разрешили?';
//     console.log(isAge)
//         return isAge
// }
// checkAge(21)

function checkAge(age) {
    let isAge =  (age > 18)||'Родители разрешили?' ;
    console.log(isAge)
         return isAge
}
checkAge(23)