//👀DESCRIPTION:
//Перепишите функцию, используя оператор '?' или '||'
// важность: 4

// Следующая функция возвращает true, если параметр age больше 18.
//function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     return confirm('Родители разрешили?');
//   }
// }
// В ином случае она задаёт вопрос confirm и возвращает его результат.

//👨‍💻SOLUTION:
//"?"

// function checkAge(age) {
//     let isAge = (age > 18)?true:'Родители разрешили?';
//     console.log(isAge)
//     return (isAge)
// }
// checkAge(19)

//"||"

function checkAge(age) {
    let isAge = (age > 18)||'Родители разрешили?';
    console.log(isAge)
    return (isAge)
}
checkAge(17)

