//👀DESCRIPTION:
//Функция pow(x,n)
// важность: 4
//
// Напишите функцию pow(x,n), которая возводит x в степень n и возвращает результат.
//
// pow(3, 2) = 3 * 3 = 9
// pow(3, 3) = 3 * 3 * 3 = 27
// pow(1, 100) = 1 * 1 * ...* 1 = 1
//
// Создайте страницу, которая запрашивает x и n, а затем выводит результат pow(x,n).

//📑NOTES:
//В этой задаче функция обязана поддерживать только натуральные значения n, т.е. целые от 1 и выше.


//👨‍💻SOLUTION:
function powXN (x,n) {
    let REPEAT = 1;
    let action = x
     do {
    action = (action * x);
    //action=action;
    REPEAT++
         //console.log(REPEAT)
         //console.log(action)
         //return(action)
}
    while (REPEAT<n)
    console.log(REPEAT)
    console.log(action)
    return (action)
    }
    //console.log(action)

powXN(3,3)

//ЗАКОНЧИТЬ С ЗАДАЧКОЙ. ВЫВОДИТЬ ЗАПРОС ПОЛЬЗОВАТЕЛЮ С ПОМОЩЬЮ "PROMPT."
