//👀DESCRIPTION:
//Напишите функцию removeElement, которая принимает массив
// и элемент, а затем возвращает новый массив без указанного элемента.
// Для перебора элементов используйте цикл for.

//📑NOTES:
//Входные данные:
//
//     array: Массив, из которого нужно удалить элемент.
//     Массив может содержать любые типы данных.
//     element: Элемент, который нужно удалить из массива.
//
// Выходные данные:
//
//     Новый массив, который не содержит указанный элемент.


//👨‍💻SOLUTION:
const arrayToGet = ['a', 'b', 'c', 'd', 'e', 'f', 'g'];


function removeElement (array, element){
    let modifiedArray = [];
    for (let i = 0; i < array.length; i++){
        if (array[i] !== element) {
            modifiedArray.push(array[i]);
        }
    }

    return(modifiedArray)
}
let newAr = removeElement(arrayToGet, 'd')
console.log('New array is: ', newAr)